## Lighthouse Labs
### W02D1 SQL

Instructor: Socorro Dominguez  
November 01, 2021

## Agenda
1. Context and Landscape (40 mins)
2. Break (10 mins)
3. Writing SELECT statements (60 mins)
    * Filtering, ordering, limiting, etc.
    * Joining tables
    * Grouping records
    * Aggregate functions
4. Exercise

[Directory Link](https://downgit.github.io/#/home?url=https://github.com/sedv8808/LighthouseLabs/tree/main/W02D1)

## Why databases?

* Organized way to store data and relate data to each other.
* Enforces strict structure and relationships (forces you to keep data clean)
    - Makes it easier to train Machine Learning algorithms
* Enables data governance (e.g., availability, usability, integrity and security of data)
* Efficient retrieval of structured data
* Can store lots of data

_"A company cannot be managed with Excel spreadsheets"_

## Why SQL?

* A lot of data is still stored in SQL databases
* Structured Query Language (SQL) still the most proficient tool to investigate, filter, slice and dice your data

## NoSQL databases
* There exists NoSQL databases (e.g., MongoDB, neo4j)
* Want to learn more? https://www.mongodb.com/nosql-explained
https://neo4j.com/

### Why are we learning SQL?

- Public dataset format has less common use-case.
- Internal database querying
    - May contain information you don’t want
    - May want to train your model on combinations/aggregations of fields from various tables
- Data exploration through simple operations on different groups/subsets
- Better understand transformations on data
- Mentioned in almost every data science job posting
    - Data science jobs ask for a ton of skills, good to have exposure to all for interview purposes, even if they won’t all realistically be necessary

### Challenges when writing SQL

- Declarative (SQL) vs. imperative/algorithmic (Python). Basically, no control flow
- Long, nested queries with many variable names
    - Vs. imperative programming where most readable programs break logic up into multiple steps
- Many things happening concurrently in a single statement, order not explicit
    - Vs. imperative programming where code executes line-by-line
- Debugging is more difficult due to the above
    - Can help to break a complex query down into steps and test those out first. Incremental approach to writing the query
    
    
To review the fundamentals: https://www.w3schools.com/sql/

### Database schemas

- How do the different tables relate to each other?
- Arguably most difficult part of relational databases is designing the schema
    - "Less of a concern for data scientists — not our job!"
- For our purposes, useful to understand table structure of a database to know how to write our queries (e.g. what tables to join)
- Common design principles
    - Star schema
    - Snowflake shema

**Resources:**
* https://www.guru99.com/star-snowflake-data-warehousing.html
* https://en.wikipedia.org/wiki/Snowflake_schema
* https://en.wikipedia.org/wiki/Star_schema

### Star Schema

<img src="star-schema.png" width=300>

* Every dimension represented by only one dimension table
* Dimension table contains set of attributes
* Dimension tables are joined to the fact table using a foreign key
* Dimension tables **are not** joined to each other
* Fact table contains key and measure

### Snowflake Schema

<img src="snowflake-schema.png" width=700>

* Extension of the star schema by adding extra dimensions
* Dimension tables are created to protect the data and to make the database more flexible,eliminating redundancy and inconsistent dependency.

## Schema comparison

**Star schema:**
* Easy to understand
* Dimension tables are not normalized - country ID does not have country lookup table
* Widely supported by BI tools

**Snowflake schema:**
* Easy to implement and "grow"
* Lower query performance with multiple tables
* More difficult to maintain with more lookup tables

## RDBMS Landscape


<img src="rdbms.png" width=400>

* Relational Database Management System
* Software system that enables users to define, create, maintain and control access to the database
* Many, many, many vendors

### RDBMS Vendors

* **Closed source** (i.e., you have to pay)
    * Vendors: Oracle, SQL Server (Microsoft), IBM DB2, Microsoft Access - local small databases
    * Could come with integrations and services that make things easier  
    
<br>

* **Open source** (i.e., free)
    * MySQL, PostgreSQL, SQLite, MariaDB
    * Good developer community makes these great options
    * [This website](https://www.digitalocean.com/community/tutorials/sqlite-vs-mysql-vs-postgresql-a-comparison-of-relational-database-management-systems#:~:text=SQLite%20is%20a%20self%2Dcontained,even%20in%20low%2Dmemory%20environments.) offers a good comparison of open source systems options.

## Why SQLite?

* Not directly comparable to client/server SQL database engines such as MySQL, Oracle, PostgreSQL, or SQL Server
* Used as on-disk file format for desktop applications
* Great to learn on to get a hang of SQL

For more information: https://www.sqlite.org/whentouse.html

## Why PostGres? 

* Created by scientists from the University of California at Berkeley
* Open source nature makes it easy to upgrade or extend
* High compliance to the SQL standard
* Offers its users a huge (and growing) number of functions allowing programmers to create new applications, better protect data integrity, and developers build resilient and secure environments
* Can easily run it on Windows, Mac OS X, and almost all Linux and Unix distributions
* MySQL would be a good choice too
* We use will use `psql`

# Break (Or make sure you install Postgres)

## Exercise

### Things we will be doing:
- Creating a PostgreSQL database using the psql shell tool.
- Importing existing data to fill the database (the drinks.sql file in this repository)
- Using the psycopg2 Python package to interact with the database (we could have alternatively used a dedicated SQL IDE like SQL Workbench, PgAdmin)
- Quering the database to explore SQL concepts such as:
    - Filtering, ordering, limiting, etc.
    - Joining tables
    - Grouping records
    - Aggregate functions

## Make sure you've installed Postgres...

1. Install PostGreSQL: https://www.postgresqltutorial.com/install-postgresql/
* From your terminal: `conda install psycopg2`, `pip install psycopg2-binary`
* Open a jupyter notebook and run `import psycopg2`to make sure it works

#### Creating the database using psql
1. Start up your terminal.
2. Start the psql shell tool. \ psql
3. List the PostgreSQL databases that exist on your computer (press "q" when you want to exit the list view).  
`\l`
4. Create a new empty database called "drinks".   
`CREATE DATABASE drinks;`
5. Confirm that the "drinks" database was created (press "q" when you want to exit the list view).   
`\l`

To write to a database:

(You will need the `drinks.sql` file in the same directory as this notebook)

In [10]:
import psycopg2
import config as cfg
import pandas as pd

postgres_pwd = cfg.postgres['password'] # This is the password you entered when you set up PGSQL

con = psycopg2.connect(database='drinks', user='postgres', password=postgres_pwd,
                       host='127.0.0.1', port='5432')  # This should work if you left everything as default

cur = con.cursor()

cur.execute(open('drinks.sql', 'r').read())  # Uncomment this the first time you run the db

## Demo & Tutorial
* Show you how to query data from a database
* Statements that start with `SELECT`

## Intro to the sample database we're using - Drinks

Database schema:

* has_on_menu(<em><ins>bar</ins></em>: string,   <em><ins>drink_id</ins></em>: string, <em><ins>price</ins></em>: real)


* orders(<em><ins>person</ins></em>: string, <em><ins>date</ins></em>: string, bar :string , <em><ins>drink_id</ins></em>: string, quantity: integer)


* drink_info(<em><ins>drink_id</ins></em>: string, <em><ins>type</ins></em>: string)

The `drink_info` relation specifies for each `drink_id` what type of drink it is, e.g., beer, wine, etc.

## Setting up the connection to our database via Python

## Executing our first query

Get the first 5 rows from orders

In [11]:
# execute a simple query
cur.execute(
"""
SELECT *
FROM orders
LIMIT 5;
""")

response = cur.fetchall()

for row in response:
    print(row[1])
#response

2016-10-16
2016-10-16
2016-10-22
2016-10-22
2016-10-22

In [12]:
# raw response
response

[('person 1', '2016-10-16', 'bar 9', 'drink 4', 1),
 ('person 1', '2016-10-16', 'bar 9', 'drink 44', 1),
 ('person 1', '2016-10-22', 'bar 19', 'drink 1', 4),
 ('person 1', '2016-10-22', 'bar 19', 'drink 9', 1),
 ('person 1', '2016-10-22', 'bar 19', 'drink 42', 2)]

* orders(<em><ins>person</ins></em>: string, <em><ins>date</ins></em>: string,  <em><ins>bar</ins></em>: string, <em><ins>drink_id</ins></em>: string, quantity: integer)

An easier way to see the data...

In [13]:
pd.DataFrame(response, columns = ['person', 'date', 'bar', 'drink_id', 'qty']) #You will learn this tomorrow

     person        date     bar  drink_id  qty
0  person 1  2016-10-16   bar 9   drink 4    1
1  person 1  2016-10-16   bar 9  drink 44    1
2  person 1  2016-10-22  bar 19   drink 1    4
3  person 1  2016-10-22  bar 19   drink 9    1
4  person 1  2016-10-22  bar 19  drink 42    2

In [14]:
# Before doing anything else, let's create a function out
# of the things we're doing above
def execute_query(query_string, return_pandas=True):
    if return_pandas:
        response = pd.read_sql_query(query_string, con)
    else:
        cur.execute(query_string)
        response = cur.fetchall()
    return response


# Let's try out our function to make sure it does
# the same as what we have above
query = """
SELECT * 
FROM orders 
LIMIT 5;
"""
execute_query(query)

     person        date     bar  drink_id  quantity
0  person 1  2016-10-16   bar 9   drink 4         1
1  person 1  2016-10-16   bar 9  drink 44         1
2  person 1  2016-10-22  bar 19   drink 1         4
3  person 1  2016-10-22  bar 19   drink 9         1
4  person 1  2016-10-22  bar 19  drink 42         2

## Quick recap for SQL

The basic format is
<img src='select-statement.png' width=200>

What would the following tell us with our database?
```
SELECT *
FROM orders
WHERE bar='bar 9'
```

---
Reminder - our schemas:

<img src='our-db.png' width=400 align='left'>

In [15]:
query2 = """
SELECT *
FROM orders
"""

execute_query(query2)

          person        date     bar  drink_id  quantity
0       person 1  2016-10-16   bar 9   drink 4         1
1       person 1  2016-10-16   bar 9  drink 44         1
2       person 1  2016-10-22  bar 19   drink 1         4
3       person 1  2016-10-22  bar 19   drink 9         1
4       person 1  2016-10-22  bar 19  drink 42         2
...          ...         ...     ...       ...       ...
1605  person 100  2016-10-08   bar 2  drink 32         1
1606  person 100  2016-10-08   bar 2  drink 33         7
1607  person 100  2016-10-08   bar 2  drink 39         2
1608  person 100  2016-10-11  bar 15  drink 10         1
1609  person 100  2016-10-11  bar 15   drink 1         2

[1610 rows x 5 columns]

In [16]:
data = execute_query(query2)

In [17]:
data

          person        date     bar  drink_id  quantity
0       person 1  2016-10-16   bar 9   drink 4         1
1       person 1  2016-10-16   bar 9  drink 44         1
2       person 1  2016-10-22  bar 19   drink 1         4
3       person 1  2016-10-22  bar 19   drink 9         1
4       person 1  2016-10-22  bar 19  drink 42         2
...          ...         ...     ...       ...       ...
1605  person 100  2016-10-08   bar 2  drink 32         1
1606  person 100  2016-10-08   bar 2  drink 33         7
1607  person 100  2016-10-08   bar 2  drink 39         2
1608  person 100  2016-10-11  bar 15  drink 10         1
1609  person 100  2016-10-11  bar 15   drink 1         2

[1610 rows x 5 columns]

In [18]:
type(data)

pandas.core.frame.DataFrame

In [19]:
data[data['bar'] == 'bar 19']

         person        date     bar  drink_id  quantity
2      person 1  2016-10-22  bar 19   drink 1         4
3      person 1  2016-10-22  bar 19   drink 9         1
4      person 1  2016-10-22  bar 19  drink 42         2
8      person 2  2016-10-26  bar 19   drink 9         1
9      person 2  2016-10-26  bar 19  drink 42         1
...         ...         ...     ...       ...       ...
1487  person 89  2016-10-01  bar 19  drink 42         3
1505  person 90  2016-10-12  bar 19  drink 42         1
1575  person 96  2016-10-03  bar 19   drink 9         4
1576  person 96  2016-10-03  bar 19  drink 42         2
1601  person 99  2016-10-05  bar 19  drink 42         2

[108 rows x 5 columns]

## Other commands

Use a cheat sheet!
<img src='sql-cheat-sheet.png' width=700>

## Joins

- `(INNER) JOIN`: Returns records that have matching values in both tables
- `LEFT (OUTER) JOIN`: Returns all records from the left table, and the matched records from the right table
- `RIGHT (OUTER) JOIN`: Returns all records from the right table, and the matched records from the left table
- `FULL (OUTER) JOIN`: Returns all records when there is a match in either left or right table

<img src='joins.png'>

### Aggregate Functions

- SQL is excellent at aggregating data the way you might in a pivot table in Excel. 
- You will use aggregate functions all the time, so it's important to get comfortable with them. 
- You know the functions1 They are the same ones you will find in Excel or any other analytics program. 
- The most important functions are:

    - `COUNT` counts how many rows are in a particular column.
    - `SUM` adds together all the values in a particular column.
    - `MIN` and MAX return the lowest and highest values in a particular column, respectively.
    - `AVG` calculates the average of a group of selected values.

## Exercise in Groups

### Remember collaboration is key.

## Let's work through some problems

### Question 1:
Get the bar name and average price of each bar

What do you think? What table do we need? What calculation do we need?

---
Reminder - our database:

<img src='our-db.png' width=400 align='left'>

Get the bar name and average price of drinks at each bar.
<table style="border: 5px; width: 100%">
 <tr>
    <td><b style="font-size:30px">has_on_menu</b></td>
    <td><b style="font-size:30px">orders</b></td>
    <td><b style="font-size:30px">drink_info</b></td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>type</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>price</b>: real</td>
    <td style="font-size:20px"><b>person</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>date</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>quantity</b>: integer</td>
    <td style="font-size:20px"></td>
 </tr>
</table>

In [4]:

'''
query= """
SELECT bar, AVG(price) FROM has_on_menu
    GROUP BY bar
"""

execute_query(query)
'''

'\nquery= """\nSELECT bar, AVG(price) FROM has_on_menu\n    GROUP BY bar\n"""\n\nexecute_query(query)\n'

### Question 2:
Get the bars with the top 5 average prices.

What do you think? How can we adapt the code we did before?

---
Reminder - our database:

<img src='our-db.png' width=400 align='left'>

Get the bar name and average price of drinks at each bar.
<table style="border: 5px; width: 100%">
 <tr>
    <td><b style="font-size:30px">has_on_menu</b></td>
    <td><b style="font-size:30px">orders</b></td>
    <td><b style="font-size:30px">drink_info</b></td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>type</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>price</b>: real</td>
    <td style="font-size:20px"><b>person</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>date</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>quantity</b>: integer</td>
    <td style="font-size:20px"></td>
 </tr>
</table>

In [13]:
'''
query= """
"""

execute_query(query)
'''

'\nquery= """\n"""\n\nexecute_query(query)\n'

### Question 3:
Which bar sells the cheapest drink? Which drink and what's the price?

---
Reminder - our database:

<img src='our-db.png' width=400 align='left'>

Get the bar name and average price of drinks at each bar.
<table style="border: 5px; width: 100%">
 <tr>
    <td><b style="font-size:30px">has_on_menu</b></td>
    <td><b style="font-size:30px">orders</b></td>
    <td><b style="font-size:30px">drink_info</b></td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>type</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>price</b>: real</td>
    <td style="font-size:20px"><b>person</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>date</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>quantity</b>: integer</td>
    <td style="font-size:20px"></td>
 </tr>
</table>

In [14]:
'''
query= """
"""

execute_query(query)
'''

'\nquery= """\n"""\n\nexecute_query(query)\n'

### Question 4:
What is the number of beers sold by each bar?

(If you interpret it to be "sold" as in available for sale, then you need `has_on_menu`; if you interpret "sold" as in a sale was made, then you need `orders`)

Hint: you need two tables here

---
Reminder - our database:

<img src='our-db.png' width=400 align='left'>

Get the bar name and average price of drinks at each bar.
<table style="border: 5px; width: 100%">
 <tr>
    <td><b style="font-size:30px">has_on_menu</b></td>
    <td><b style="font-size:30px">orders</b></td>
    <td><b style="font-size:30px">drink_info</b></td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>type</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>price</b>: real</td>
    <td style="font-size:20px"><b>person</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>date</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>quantity</b>: integer</td>
    <td style="font-size:20px"></td>
 </tr>
</table>

In [15]:
'''
query= """
"""

execute_query(query)
'''

'\nquery= """\n"""\n\nexecute_query(query)\n'

### Challenge question

For each person, find the bar they visit, and the type(s) and price(s) of the drink(s) they drink during those visits.

---
Reminder - our database:

<img src='our-db.png' width=400 align='left'>

Get the bar name and average price of drinks at each bar.
<table style="border: 5px; width: 100%">
 <tr>
    <td><b style="font-size:30px">has_on_menu</b></td>
    <td><b style="font-size:30px">orders</b></td>
    <td><b style="font-size:30px">drink_info</b></td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
    <td style="font-size:20px"><b>drink_id</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>bar</b>: string</td>
    <td style="font-size:20px"><b>type</b>: string</td>
 </tr>
 <tr>
    <td style="font-size:20px"><b>price</b>: real</td>
    <td style="font-size:20px"><b>person</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>date</b>: string</td>
    <td style="font-size:20px"></td>
 </tr>
 <tr>
    <td style="font-size:20px"></td>
    <td style="font-size:20px"><b>quantity</b>: integer</td>
    <td style="font-size:20px"></td>
 </tr>
</table>

In [16]:
'''
query= """
"""

execute_query(query)
'''

'\nquery= """\n"""\n\nexecute_query(query)\n'

### Making sure we close off the connection

In [17]:
cur.close()

## Additional resoures

* [Mode Tutorial](https://mode.com/sql-tutorial/)